#include<stdio.h>
int id = 1;
void ifgame(char x[][3])
{
    if(x[0][0] != ' ' && x[0][0] == x[0][1] && x[0][1] == x[0][2])
    {
        printf("玩家 %c 获胜！\n", x[0][0]);
        id = 0;
    }
    else if(x[1][0] != ' ' && x[1][0] == x[1][1] && x[1][1] == x[1][2]) 
    {
        printf("玩家 %c 获胜！\n", x[1][0]);
        id = 0;
    }
    else if(x[2][0] != ' ' && x[2][0] == x[2][1] && x[2][1] == x[2][2])
    {
        printf("玩家 %c 获胜！\n", x[2][0]);
        id = 0;
    }//行胜利判断
    else if (x[0][0] != ' ' && x[0][0] == x[1][0] && x[1][0] == x[2][0])
    {
        printf("玩家 %c 获胜！\n", x[0][0]);
        id = 0;
    }
    else if(x[0][1] != ' ' && x[0][1] == x[1][1] && x[1][1] == x[2][1])
    {
        printf("玩家 %c 获胜！\n", x[0][1]);
        id = 0;
    }
    else if (x[0][2] != ' ' && x[0][2] == x[1][2] && x[1][2] == x[2][2])
    {
        printf("玩家 %c 获胜！\n", x[0][2]);
        id = 0;
    }//列胜利判断
    else if (x[0][0] != ' ' && x[0][0] == x[1][1] && x[1][1] == x[2][2])
    {
        printf("玩家 %c 获胜！\n", x[0][0]);
        id = 0;
    }
    else if (x[0][2] != ' ' && x[0][2] == x[1][1] && x[1][1] == x[2][0])
    {
        printf("玩家 %c 获胜！\n", x[0][2]);
        id = 0;
    }//对角线胜利判断
    else//平局判断
    {
        int draw = 1,i = 0,j = 0;
        for ( i = 0; i < 3; i++)
        {
            for ( j = 0; j < 3; j++)
            {
                if (x[i][j] == ' ')
                {
                    draw = 0;
                }
            } 
        }
        if (draw == 1)
        {
            printf("平局！\n");
            id = 0;
        }
    }
}