#include <stdio.h>
int b()
{
    return 1;
}
int main()
{
    int a = 100;
    int* a1 = &a;
    int** a2 = &a1;//二级指针,指针指向前一个指针的地址,访问二级指针的内容也需要两个**
    int b1 = 10,b2 = 20,b3 = 30;
    int* parr[] = {&b1,&b2,&b3};//指针数组,一整个数组都存储指针变量
    int c1[3][4] = {{0,1,2,3},{4,5,6,7},{8,9,10,11}};//二维数组
    int (*p)[4] = c1;//[]运算优先级高于*,故需要加()不然定义为指针数组,此时p+1移动的长度为16字节,对应数组的一维的长度,*(p+1)表示第一行的数据,*(*(p+1)+1)表示第一行第一个数据
    int (*func)() = b;//函数指针,用一个指针变量来接受函数
    printf("%d",(*func)());
    int arr[9];
    printf("%d",&arr[9]-&arr[0]);//数组指针相减,输出数组之间的容量
    int arr1[3] = {1,2,3};
    int(*parr1)[3] = &arr1;//数组指针
    int *parr2 = arr1;//注意此时的parr1和parr2,此时的parr1指向数组,+1后跳过一整个数组,parr2指向arr1的首元素+1后跳过一个元素,虽然parr1和parr2的值相同,当定义不同
    printf("%d",*(*parr1+1));//此时表示对parr1解引用,解出的结果为arr1,arr1为数组名,+1后再对地址进行解引用,这种方法不常用,这种方法多用于二维数组
    printf("%d",*(parr2+1));//一般用这种方式
    return 0;
}